---
type: IExtension
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# IExtension

`Autodesk.Revit.DB.IExtension` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Extended | — | `bool this [ int index ] { get ; set ; }` |
| Property | HasMiter | — | `bool this [ int index ] { get ; }` |
| Property | IsMiterLocked | — | `bool this [ int index ] { get ; set ; }` |
| Property | SymbolicExtended | — | `bool this [ int index ] { get ; set ; }` |